cliuxinxin/esp8266-ai/firmware/src/main.cpp
// ---------- stock watchlist screen ----------

bool handleStockPayload(const String &payload) {
  JsonDocument doc;
  if (deserializeJson(doc, payload)) return false;
  JsonArray arr = doc["stocks"];
  stockCount = 0;
  for (JsonObject s : arr) {
    if (stockCount >= MAX_STOCKS) break;
    stocks[stockCount].code = s["code"] | "";
    stocks[stockCount].price = s["price"] | "";
    stocks[stockCount].pct = s["pct"] | "";
    stocks[stockCount].up = s["up"] | 0;
    stockCount++;
  }
  stockNamesRev = doc["names_rev"] | -1;
  stockEverLoaded = true;
  stockDirty = true;
  return true;
}

// Streams the Mac-rendered name strips and blits one per row (top line,
// right of the ASCII code). Wired-only mode has no HTTP: codes still show.
bool drawStockNames() {
  if (WiFi.status() != WL_CONNECTED || bridgeHost.length() == 0) return false;
  WiFiClient client;
  HTTPClient http;
  String url = "http://" + bridgeHost + "/stock/names.raw";
  http.setTimeout(BRIDGE_HTTP_TIMEOUT_MS);
  if (!http.begin(client, url)) return false;
  int code = http.GET();
  if (code != HTTP_CODE_OK) {
    http.end();
    return false;
  }
  WiFiClient *stream = http.getStreamPtr();
  uint8_t cnt = 0;
  if (stream->readBytes(&cnt, 1) != 1) {
    http.end();
    return false;
  }
  const size_t rowBytes = (size_t)STOCK_NAME_W * 2;
  bool ok = true;
  for (int i = 0; i < cnt && ok; i++) {
    int y0 = 10 + i * 54;
    for (int r = 0; r < STOCK_NAME_H; r++) {
      if (stream->readBytes((uint8_t *)rowBuf, rowBytes) != (int)rowBytes) {
        ok = false;
        break;
      }
      if (i < stockCount) tft.pushImage(70, y0 + r, STOCK_NAME_W, 1, rowBuf);
      yield();
    }
  }
  http.end();
  return ok;
}

void pollStock() {
  if (WiFi.status() != WL_CONNECTED || bridgeHost.length() == 0) return;
  WiFiClient client;
  HTTPClient http;
  String url = "http://" + bridgeHost + "/stock";
  http.setTimeout(BRIDGE_HTTP_TIMEOUT_MS);
  if (!http.begin(client, url)) return;
  int code = http.GET();
  if (code == HTTP_CODE_OK) handleStockPayload(http.getString());
  http.end();
}

// 54px per row: small grey code on top, big font-4 price (white) on the left
// and change% on the right - red rising / green falling (CN convention).
// Rows repaint only when their text changes, same trick as everywhere else.
void drawStockScreen() {
  if (!stockChromeDrawn) {
    tft.fillScreen(TFT_BLACK);
    stockChromeDrawn = true;
    for (int i = 0; i < MAX_STOCKS; i++) {
      stockLastCode[i] = "\x01"; // force repaint
      stockLastVal[i] = "\x01";
    }
    stockNamesDrawnRev = -1;
    tft.setTextDatum(TC_DATUM);
    tft.setTextColor(0x7BEF, TFT_BLACK);
    tft.drawString("STOCKS", SCREEN_CX, 228, 1);
  }
  stockDirty = false;

  if (stockCount == 0) {
    if (stockLastCode[0] != "") {
      for (int i = 0; i < MAX_STOCKS; i++) {
        stockLastCode[i] = "";
        stockLastVal[i] = "";
      }
      tft.fillRect(0, 0, SCREEN_W, 226, TFT_BLACK);
      tft.setTextDatum(TC_DATUM);
      tft.setTextColor(TFT_LIGHTGREY, TFT_BLACK);
      tft.drawString(stockEverLoaded ? "No stocks configured" : "Waiting for bridge...", SCREEN_CX, 100, 2);
      if (stockEverLoaded) tft.drawString("Mac menu: Set watchlist", SCREEN_CX, 124, 2);
    }
    return;
  }

  for (int i = 0; i < MAX_STOCKS; i++) {
    int y0 = 10 + i * 54;
    bool has = i < stockCount;
    // top line (code + name strip) and value line refresh independently, so
    // a price tick never wipes the name bitmap
    String codeKey = has ? stocks[i].code : "";
    if (codeKey != stockLastCode[i]) {
      stockLastCode[i] = codeKey;
      tft.fillRect(0, y0, SCREEN_W, 17, TFT_BLACK);
      stockNamesDrawnRev = -1; // strip area wiped: re-fetch names
      if (has) {
        tft.setTextDatum(TL_DATUM);
        tft.setTextColor(0x7BEF, TFT_BLACK);
        tft.drawString(stocks[i].code, 14, y0, 2);
      }
    }
    String valKey = has ? stocks[i].price + "|" + stocks[i].pct + "|" + String(stocks[i].up) : "";
    if (valKey != stockLastVal[i]) {
      stockLastVal[i] = valKey;
      tft.fillRect(0, y0 + 18, SCREEN_W, 36, TFT_BLACK); // value line + inter-row gap
      if (has) {
        tft.setTextDatum(TL_DATUM);
        tft.setTextColor(TFT_WHITE, TFT_BLACK);
        tft.drawString(stocks[i].price, 14, y0 + 18, 4);
        uint16_t pc = stocks[i].up > 0 ? TFT_RED : (stocks[i].up < 0 ? TFT_GREEN : TFT_LIGHTGREY);
        tft.setTextDatum(TR_DATUM);
        tft.setTextColor(pc, TFT_BLACK);
        tft.drawString(stocks[i].pct, 226, y0 + 18, 4);
      }
    }
  }

  // CJK name strips, re-fetched when the watchlist (names_rev) changes
  if (stockNamesRev >= 0 && stockNamesDrawnRev != stockNamesRev) {
    if (drawStockNames()) stockNamesDrawnRev = stockNamesRev;
  }
}

// ---------- weather screen ----------

int weatherInt(JsonVariant value) {
  return value.isNull() ? WEATHER_MISSING : (int)lround(value.as<float>());
}

String weatherValue(int value, const char *suffix = "") {
  return value == WEATHER_MISSING ? "--" : String(value) + suffix;
}

bool handleWeatherPayload(const String &payload) {
  JsonDocument doc;
  if (deserializeJson(doc, payload) || (doc["available"].is<bool>() && !doc["available"].as<bool>())) return false;
  if (!doc["city"].is<const char *>() || !doc["weather_code"].is<int>() || !doc["updated_at"].is<long>()) return false;
  WeatherState next;
  next.valid = true;
  next.stale = doc["stale"] | false;
  next.city = doc["city"].as<String>();
  next.code = doc["weather_code"].as<int>();
  next.temperature = weatherInt(doc["temperature"]);
  next.apparent = weatherInt(doc["apparent_temperature"]);
  next.high = weatherInt(doc["high"]);
  next.low = weatherInt(doc["low"]);
  next.humidity = weatherInt(doc["humidity"]);
  next.rain = weatherInt(doc["precipitation_probability"]);
  next.windSpeed = weatherInt(doc["wind_speed"]);
  next.aqi = weatherInt(doc["aqi"]);
  next.textRev = doc["text_rev"] | -1;
  JsonArray days = doc["forecast"];
  for (JsonObject day : days) {
    if (next.forecastCount >= 3) break;
    WeatherDay &target = next.forecast[next.forecastCount++];
    target.label = day["day"] | "--";
    target.code = day["code"] | -1;
    target.high = weatherInt(day["high"]);
    target.low = weatherInt(day["low"]);
  }
  weather = next;
  weatherDirty = true;
  return true;
}

void drawWeatherIcon(int x, int y, int code, int size) {
  WeatherIconKind kind = weatherIconForCode(code);
  uint16_t sun = 0xFFE0, cloud = 0xC618, rain = 0x4D7F;
  if (kind == WEATHER_CLEAR || kind == WEATHER_PARTLY_CLOUDY) {
    tft.fillCircle(x + size / 2, y + size / 2, size / 4, sun);
  }
  if (kind != WEATHER_CLEAR) {
    tft.fillCircle(x + size / 3, y + size / 2, size / 5, cloud);
    tft.fillCircle(x + size / 2, y + size / 2 - 3, size / 4, cloud);
    tft.fillRect(x + size / 5, y + size / 2, size * 3 / 5, size / 4, cloud);
  }
  if (kind == WEATHER_RAIN || kind == WEATHER_SHOWERS || kind == WEATHER_THUNDERSTORM) {
    for (int i = 0; i < 3; i++) tft.drawLine(x + 8 + i * 8, y + size * 3 / 4, x + 5 + i * 8, y + size - 1, rain);
  } else if (kind == WEATHER_SNOW) {
    for (int i = 0; i < 3; i++) tft.fillCircle(x + 7 + i * 9, y + size - 5, 2, TFT_WHITE);
  }
}

