cliuxinxin/esp8266-ai/firmware/src/main.cpp
bool drawWeatherText() {
  if (WiFi.status() != WL_CONNECTED || bridgeHost.length() == 0 || weather.textRev < 0) return false;
  WiFiClient client;
  HTTPClient http;
  http.setTimeout(BRIDGE_HTTP_TIMEOUT_MS);
  if (!http.begin(client, "http://" + bridgeHost + "/weather/text.raw")) return false;
  if (http.GET() != HTTP_CODE_OK || http.getSize() != 1 + WEATHER_TEXT_COUNT * WEATHER_TEXT_W * WEATHER_TEXT_H * 2) {
    http.end();
    return false;
  }
  WiFiClient *stream = http.getStreamPtr();
  uint8_t count = 0;
  if (stream->readBytes(&count, 1) != 1 || count != WEATHER_TEXT_COUNT) { http.end(); return false; }
  const int xs[WEATHER_TEXT_COUNT] = {4, 4, 116, 174, 8, 88, 168};
  const int ys[WEATHER_TEXT_COUNT] = {4, 22, 136, 4, 184, 184, 184};
  const int widths[WEATHER_TEXT_COUNT] = {100, 90, 100, 62, 64, 64, 64};
  bool ok = true;
  for (int strip = 0; strip < WEATHER_TEXT_COUNT && ok; strip++) {
    for (int row = 0; row < WEATHER_TEXT_H; row++) {
      if (stream->readBytes((uint8_t *)rowBuf, WEATHER_TEXT_W * 2) != WEATHER_TEXT_W * 2) { ok = false; break; }
      tft.pushImage(xs[strip], ys[strip] + row, widths[strip], 1, rowBuf);
      yield();
    }
  }
  http.end();
  return ok;
}

void drawWeatherScreen() {
  if (!weather.valid) {
    tft.fillScreen(TFT_BLACK);
    tft.setTextDatum(TC_DATUM);
    tft.setTextColor(TFT_LIGHTGREY, TFT_BLACK);
    tft.drawString("Weather unavailable", SCREEN_CX, 104, 2);
    tft.drawString("Waiting for Mac bridge", SCREEN_CX, 130, 2);
    weatherChromeDrawn = true;
    return;
  }
  tft.fillScreen(TFT_BLACK);
  weatherChromeDrawn = true;
  weatherTextDrawnRev = -1;
  weatherDirty = false;
  tft.setTextDatum(TL_DATUM);
  tft.setTextColor(TFT_WHITE, TFT_BLACK);
  tft.drawString(weatherValue(weather.temperature, " C"), 12, 48, 7);
  drawWeatherIcon(174, 48, weather.code, 48);
  tft.setTextColor(TFT_LIGHTGREY, TFT_BLACK);
  tft.drawString("Feels " + weatherValue(weather.apparent, " C"), 12, 102, 2);
  tft.drawString("H/L " + weatherValue(weather.high) + "/" + weatherValue(weather.low), 12, 124, 2);
  tft.drawString("Humidity " + weatherValue(weather.humidity, "%"), 12, 146, 2);
  tft.drawString("Rain " + weatherValue(weather.rain, "%"), 128, 112, 2);
  tft.drawString("Wind " + weatherValue(weather.windSpeed, " km/h"), 116, 158, 2);
  tft.setTextDatum(TR_DATUM);
  tft.drawString("AQI " + weatherValue(weather.aqi), 232, 22, 2);
  if (weather.stale) {
    tft.setTextDatum(TR_DATUM); tft.setTextColor(TFT_YELLOW, TFT_BLACK); tft.drawString("!", 232, 22, 2);
  }
  for (int i = 0; i < weather.forecastCount; i++) {
    int x = 8 + i * 80;
    drawWeatherIcon(x + 18, 201, weather.forecast[i].code, 25);
    tft.setTextDatum(TC_DATUM); tft.setTextColor(TFT_LIGHTGREY, TFT_BLACK);
    tft.drawString(weatherValue(weather.forecast[i].high) + "/" + weatherValue(weather.forecast[i].low), x + 32, 227, 1);
  }
  if (weather.textRev != weatherTextDrawnRev && drawWeatherText()) weatherTextDrawnRev = weather.textRev;
}

void pollWeather() {
  if (WiFi.status() != WL_CONNECTED || bridgeHost.length() == 0) return;
  WiFiClient client;
  HTTPClient http;
  http.setTimeout(BRIDGE_HTTP_TIMEOUT_MS);
  if (!http.begin(client, "http://" + bridgeHost + "/weather")) return;
  if (http.GET() == HTTP_CODE_OK) handleWeatherPayload(http.getString());
  http.end();
}

// ---------- quote screen ----------

// HTTP /quote and serial #QUOTE both enter through this parser. Build a
// complete replacement first so malformed/unavailable polls never destroy a
// previously usable quote.
bool handleQuotePayload(const String &payload, QuoteMetadataTransport transport) {
  JsonDocument doc;
  if (deserializeJson(doc, payload) ||
      (doc["available"].is<bool>() && !doc["available"].as<bool>())) {
    return false;
  }
  if (!doc["text"].is<const char *>() || !doc["language"].is<const char *>() ||
      !doc["updated_at"].is<long>() || !doc["text_rev"].is<int>()) {
    return false;
  }
  String text = doc["text"].as<String>();
  text.trim();
  const int textRev = doc["text_rev"].as<int>();
  if (text.length() == 0 || textRev < 0) return false;

  QuoteState next;
  next.valid = true;
  next.textRev = textRev;
  next.language = doc["language"].as<String>();
  next.updatedAt = doc["updated_at"].as<long>();
  next.stale = doc["stale"] | false;

  const bool changed = !quote.valid || next.textRev != quote.textRev;
  quote = next;
  quoteDirty = quoteDirty || changed;
  // Serial proves only that metadata can arrive over USB. It never changes
  // the separately tracked HTTP reachability or bitmap retry deadline.
  noteQuoteMetadataReceived(quoteBitmapFetchState, transport);
  return true;
}

bool quoteCanEnterMode() {
  if (!quote.valid || quote.textRev < 0) return false;
  if (quoteScreenDrawn && quoteTextDrawnRev == quote.textRev) return true;
  return WiFi.status() == WL_CONNECTED && bridgeHost.length() > 0 &&
         quoteBitmapFetchAllowed(quoteBitmapFetchState, millis());
}

// The quote page is exactly one 240x240 RGB565 frame. Stream one 480-byte row
// at a time through the shared scratch buffer; a full frame would consume
// 115,200 bytes and cannot fit in ESP8266 RAM.
bool drawQuoteScreen() {
  if (quoteScreenDrawn && quoteTextDrawnRev == quote.textRev && !quoteDirty) return true;
  if (!quote.valid || quote.textRev < 0 || WiFi.status() != WL_CONNECTED ||
      bridgeHost.length() == 0 || !quoteBitmapFetchAllowed(quoteBitmapFetchState, millis())) {
    return false;
  }

  WiFiClient client;
  HTTPClient http;
  http.setTimeout(BRIDGE_HTTP_TIMEOUT_MS);
  if (!http.begin(client, "http://" + bridgeHost + "/quote/text.raw")) {
    noteQuoteBitmapFetchFailure(quoteBitmapFetchState, millis());
    quoteScreenDrawn = false;
    return false;
  }
  const int expectedBytes = SCREEN_W * SCREEN_H * 2;
  if (http.GET() != HTTP_CODE_OK || http.getSize() != expectedBytes) {
    http.end();
    noteQuoteBitmapFetchFailure(quoteBitmapFetchState, millis());
    quoteScreenDrawn = false;
    return false;
  }

  WiFiClient *stream = http.getStreamPtr();
  const size_t rowBytes = (size_t)SCREEN_W * 2;
  bool ok = true;
  quoteScreenDrawn = false;
  for (int row = 0; row < SCREEN_H; ++row) {
    if (stream->readBytes((uint8_t *)rowBuf, rowBytes) != (int)rowBytes) {
      ok = false;
      break;
    }
    tft.pushImage(0, row, SCREEN_W, 1, rowBuf);
    yield();
  }
  http.end();
  if (!ok) {
    noteQuoteBitmapFetchFailure(quoteBitmapFetchState, millis());
    return false;
  }

