cliuxinxin/esp8266-ai/firmware/src/main.cpp
// The mode actually rendered. Fixed modes bypass this state machine. AUTO
// checks events first, then resumes any interrupted page, then fairly selects
// the oldest valid due page.
DisplayMode effectiveMode() {
  AutoTransitionInputs input;
  input.autoMode = displayMode == MODE_AUTO;
  input.nowMs = millis();
  input.approvalNeeded = claudeStatus.needsInput || codexStatus.needsInput;
  input.claudeWorking = claudeStatus.status == "working";
  input.codexWorking = codexStatus.status == "working";
  // The music page needs HTTP for its cover/text bitmaps, so wired-only mode
  // does not auto-promote it.
  input.musicPlaying = statusMusicPlaying && WiFi.status() == WL_CONNECTED;
  input.validMask = autoScheduledValidityMask();

  const AutoDisplayChoice choice = advanceAutoDisplay(autoDisplayRuntime, input);
  if (!input.autoMode) {
    // Keep the configured fixed mode, but report/render the pet until a quote
    // revision is actually reachable. This prevents a wired-only #QUOTE frame
    // from switching to a bitmap that the device cannot download.
    if (displayMode == MODE_QUOTE && !quoteCanEnterMode()) return MODE_AUTO;
    return displayMode;
  }
  if (choice == AUTO_MUSIC) return MODE_MUSIC;
  if (choice == AUTO_WEATHER) return MODE_WEATHER;
  if (choice == AUTO_QUOTE) return MODE_QUOTE;
  if (choice == AUTO_STOCK) return MODE_STOCK;
  if (choice == AUTO_NET) return MODE_NET;
  return MODE_AUTO;
}

void scheduledModeBecameVisible(DisplayMode mode) {
  if (displayMode != MODE_AUTO) return;
  AutoDisplayChoice choice = AUTO_IDLE;
  if (mode == MODE_WEATHER) choice = AUTO_WEATHER;
  else if (mode == MODE_QUOTE) choice = AUTO_QUOTE;
  else if (mode == MODE_STOCK) choice = AUTO_STOCK;
  else if (mode == MODE_NET) choice = AUTO_NET;
  if (choice != AUTO_IDLE) autoScheduledPageBecameVisible(autoDisplayRuntime, choice, millis());
}

void pollBridge() {
  if (WiFi.status() != WL_CONNECTED || bridgeHost.length() == 0) {
    noteQuoteHTTPMetadataFailure(quoteBitmapFetchState);
    Serial.printf("[bridge] skip poll: wifi=%d host='%s'\n", WiFi.status() == WL_CONNECTED, bridgeHost.c_str());
    return;
  }

  WiFiClient client;
  HTTPClient http;
  String url = "http://" + bridgeHost + BRIDGE_DEFAULT_PATH;
  http.setTimeout(BRIDGE_HTTP_TIMEOUT_MS);

  if (!http.begin(client, url)) {
    noteQuoteHTTPMetadataFailure(quoteBitmapFetchState);
    Serial.println("[bridge] http.begin() failed");
    return;
  }
  int code = http.GET();
  Serial.printf("[bridge] GET %s -> %d\n", url.c_str(), code);
  if (code == HTTP_CODE_OK) {
    noteQuoteHTTPReachable(quoteBitmapFetchState);
    String payload = http.getString();
    if (parseStatusJson(payload)) {
      lastSuccessMs = millis();
      everPolled = true;
      Serial.printf("[bridge] claude=%s tok=%ld | codex=%s tok=%ld primary=%.0f%%\n",
                    claudeStatus.status.c_str(), claudeStatus.tokensToday,
                    codexStatus.status.c_str(), codexStatus.tokensToday, codexStatus.primaryPct);
    } else {
      Serial.println("[bridge] JSON parse failed");
    }
  } else {
    noteQuoteHTTPMetadataFailure(quoteBitmapFetchState);
    claudeStatus.status = "offline";
    codexStatus.status = "offline";
  }
  http.end();
  DisplayMode eff = effectiveMode();
  if (eff != MODE_NET && eff != MODE_MUSIC && eff != MODE_STOCK && eff != MODE_WEATHER &&
      eff != MODE_QUOTE) {
    // Only a real app switch clears the screen; a plain data refresh paints
    // in place so the poll doesn't flash the whole display.
    if (updateActiveApp()) drawActiveApp();
    else refreshActiveApp();
  }
}

// ---------- wired (USB serial) bridge link ----------
// Fallback for WiFi networks with client isolation (device can't reach the
// bridge over LAN) - or for skipping WiFi setup entirely: when the clock is
// plugged into the computer over USB, the bridge pushes the same /status and
// content payloads down the CH340 serial line as newline-terminated frames:
//   bridge -> device:  #HELLO  #STATUS/#NET/#STOCK/#QUOTE {json}  #CMD {json}
//   device -> bridge:  #DEVICE {"name":"aiclock","fw":"x.y.z"}
// Everything else the device prints (logs) is ignored by the bridge.
unsigned long lastSerialFrameMs = 0;
bool wiredEverLinked = false;
char serialLine[1600]; // biggest frame is #STATUS at ~600 bytes
size_t serialLineLen = 0;

bool wiredActive() { return wiredEverLinked && (millis() - lastSerialFrameMs) < 15000UL; }

// First data over either transport replaces the boot/portal screen.
void showMainUiIfNeeded() {
  if (mainUiShown) return;
  mainUiShown = true;
  drawStaticChrome();
  updateActiveApp();
  drawActiveApp();
}

void handleSerialFrame(char *line) {
  lastSerialFrameMs = millis();
  wiredEverLinked = true;
  if (!strncmp(line, "#HELLO", 6)) {
    Serial.printf("#DEVICE {\"name\":\"aiclock\",\"fw\":\"%s\"}\n", FW_VERSION);
    return;
  }
  if (!strncmp(line, "#STATUS ", 8)) {
    if (parseStatusJson(String(line + 8))) {
      lastSuccessMs = millis();
      everPolled = true;
      showMainUiIfNeeded();
      DisplayMode eff = effectiveMode();
      if (eff != MODE_NET && eff != MODE_MUSIC && eff != MODE_STOCK && eff != MODE_WEATHER &&
          eff != MODE_QUOTE) {
        if (updateActiveApp()) drawActiveApp();
        else refreshActiveApp();
      }
    }
    return;
  }
  if (!strncmp(line, "#NET ", 5)) {
    handleNetPayload(String(line + 5));
    return;
  }
  if (!strncmp(line, "#STOCK ", 7)) {
    handleStockPayload(String(line + 7));
    return;
  }
  if (!strncmp(line, "#QUOTE ", 7)) {
    handleQuotePayload(String(line + 7), QUOTE_METADATA_SERIAL);
    return;
  }
  if (!strncmp(line, "#CMD ", 5)) {
    JsonDocument doc;
    if (deserializeJson(doc, line + 5)) return;
    if (doc["brightness"].is<int>()) {
      brightness = constrain(doc["brightness"].as<int>(), 0, 100);
      applyBrightness();
      saveBrightness();
    }
    const char *mode = doc["display"] | (const char *)nullptr;
    if (mode) {
      String m(mode);
      if (m == "auto") displayMode = MODE_AUTO;
      else if (m == "claude") displayMode = MODE_CLAUDE;
      else if (m == "codex") displayMode = MODE_CODEX;
      else if (m == "net") displayMode = MODE_NET;
      else if (m == "music") displayMode = MODE_MUSIC;
      else if (m == "stock") displayMode = MODE_STOCK;
      else if (m == "weather") displayMode = MODE_WEATHER;
      else if (m == "quote") displayMode = MODE_QUOTE;
      // the effectiveMode transition handler in loop() repaints the chrome
    }
    return;
  }
}

